{
    "INTERNAL_SERVER_ERROR_MESSAGE" : "Erreur interne du serveur!",
    "NOT_FOUND_MESSAGE" : "Ressource introuvable!",
    "AUTHORIZATION_ERROR_MESSAGE" : "Utilisateur non autorisé !",
    "PERMISSION_AUTHORIZATION_ERROR": "Vous ne disposez pas des autorisations requises pour accéder à cette ressource",


    "LOGIN_SUCCESSFUL": "Vous vous êtes connecté avec succès.",
    "LOGIN_FAILED": "Échec de la connexion. Veuillez vérifier votre adresse e-mail et votre mot de passe.",
    "LOGOUT_SUCCESSFUL": "Vous vous êtes déconnecté avec succès.",
    "LOGOUT_FAILED": "Échec de la déconnexion. Veuillez réessayer ultérieurement.",
    "USER_NOT_FOUND": "Utilisateur introuvable. Veuillez vous inscrire pour continuer.",
    "LOGIN_UN_SUCCESSFUL_WITHOUT_PASSWORD": "Veuillez définir un mot de passe avant de vous connecter.",
    "INVALID_EMAIL": "Adresse e-mail invalide. Veuillez entrer une adresse e-mail valide.",
    "INVALID_PASSWORD": "Mot de passe invalide. Les mots de passe doivent comporter au moins 6 caractères.",
    "URL_CORRECT": "Le lien pour réinitialiser votre mot de passe est valide.",
    "URL_EXPIRED": "Le lien pour réinitialiser votre mot de passe a expiré. Veuillez demander un nouveau lien.",
    "LINK_INCORRECT": "Le lien pour réinitialiser votre mot de passe est incorrect. Assurez-vous de l'avoir copié correctement.",
    "INVITE_URL_CORRECT": "Le lien pour définir votre mot de passe est valide.",
    "INVITE_URL_EXPIRED": "Votre code d'invitation a expiré. Veuillez en demander un nouveau.",
    "INVITE_LINK_INCORRECT": "Le code d'invitation est incorrect. Assurez-vous de l'avoir copié correctement.",
    "EMAIL_SENT": "Veuillez vérifier votre boîte de réception e-mail pour le lien permettant de changer votre mot de passe.",
    "PASSWORD_RESET_SUCCESSFULLY": "Votre mot de passe a été réinitialisé avec succès.",
    "PASSWORD_RESET_UN_SUCCESSFULLY": "Impossible de réinitialiser votre mot de passe. Veuillez réessayer ultérieurement.",
    "CURRENT_PASSWORD_INVALID": "Le mot de passe actuel que vous avez saisi est invalide.",
    "INITIAL_PASSWORD_SETUP_SUCCESS": "Configuration du mot de passe réussie. Vous pouvez maintenant vous connecter.",
    "INITIAL_PASSWORD_SETUP_ERROR": "Échec de la configuration du mot de passe. Veuillez réessayer.",
    "PASSWORD_CHANGE_SUCCESSFULLY": "Mot de passe modifié avec succès.",
    "PASSWORD_CHANGE_UN_SUCCESSFULLY": "Impossible de mettre à jour votre mot de passe. Veuillez réessayer.",
    "PASSWORD_MISMATCH": "Le nouveau mot de passe et la confirmation du mot de passe ne correspondent pas.",
    "EMAIL_ERROR_MISSING": "Adresse e-mail manquante. Veuillez entrer votre adresse e-mail.",
    "EMAIL_ERROR_EMPTY": "L'adresse e-mail est vide. Veuillez entrer votre adresse e-mail.",
    "EMAIL_ERROR_INVALID": "Adresse e-mail invalide. Veuillez entrer une adresse e-mail valide.",
    "EMAIL_UNIQUE": "L'adresse e-mail doit être unique. Veuillez utiliser une adresse e-mail différente.",
    "EMAIL_REQUIRED": "L'adresse e-mail est requise. Veuillez entrer votre adresse e-mail.",
    "NAME_MISSING": "Le nom est manquant. Veuillez entrer votre nom.",
    "NAME_EMPTY": "Le nom est vide. Veuillez entrer votre nom.",
    "PASSWORD_ERROR_MISSING": "Le mot de passe est manquant. Veuillez entrer votre mot de passe.",
    "PASSWORD_ERROR_EMPTY": "Le mot de passe est vide. Veuillez entrer votre mot de passe.",
    "PASSWORD_MUST_BE_STRING": "Le mot de passe doit être une chaîne de caractères. Veuillez entrer un mot de passe valide.",
    "PASSWORD_LENGTH": "Le mot de passe doit comporter au moins 6 caractères.",
    "IN_VALID_PASSWORD_TYPE": "Le mot de passe doit contenir au moins 1 chiffre, 1 lettre majuscule, 1 caractère spécial, et doit avoir entre 6 et 15 caractères.",
    "OLD_PASSWORD_REQUIRED": "Veuillez entrer votre ancien mot de passe.",
    "NEW_PASSWORD_REQUIRED": "Veuillez entrer votre nouveau mot de passe.",
    "CONFIRM_PASSWORD": "Le champ de confirmation du mot de passe est requis. Veuillez confirmer votre mot de passe.",
    "IN_VALID_CONFIRM_PASSWORD": "Le mot de passe de confirmation ne correspond pas au mot de passe. Veuillez vous assurer qu'ils sont identiques.",
    "TOKEN_INVALID": "Votre jeton de réinitialisation de mot de passe n'est pas valide. Veuillez entrer un jeton valide.",
    "TOKEN_REQUIRED": "Le jeton de réinitialisation du mot de passe est requis. Veuillez entrer un jeton valide.",
    "MISSING_ACCESS_TOKEN": "Le jeton d'accès est requis. Veuillez fournir un jeton d'accès valide.",
    "INVALID_CREDENTIAL": "Identifiants invalides. Veuillez vérifier votre adresse e-mail et votre mot de passe.",
    
    "USER_ALREADY_EXISTS":
    "Oups ! Il semble qu'un utilisateur avec cette adresse e-mail ou ce numéro de téléphone soit déjà enregistré. Veuillez utiliser une adresse e-mail ou un numéro de téléphone différent pour créer un nouveau compte.",
    "USERS_FOUND": "Utilisateurs trouvés.",
    "USERS_NOT_FOUND": "Aucun utilisateur trouvé.",
    "USERS_ADDED": "Utilisateurs enregistrés avec succès.",
    "USERS_NOT_ADDED": "Échec de l'enregistrement des utilisateurs.",
    "USERS_ADD_REJECTED": "L'adresse e-mail doit être unique.",
    "USER_UPDATED": "Utilisateur mis à jour avec succès.",
    "USER_NOT_UPDATE": "Échec de la mise à jour de l'utilisateur.",
    "USER_DELETED": "Utilisateur supprimé avec succès.",
    "USER_NOT_DELETE": "Échec de la suppression de l'utilisateur.",
    "FIRST_NAME_REQUIRED": "Le prénom est requis.",
    "FIRST_NAME_MUST_BE_STRING": "Le prénom doit être un texte valide.",
    "LAST_NAME_REQUIRED": "Le nom de famille est requis.",
    "LAST_NAME_MUST_BE_STRING": "Le nom de famille doit être un texte valide.",
    "EMAIL_EXISTS": "Un utilisateur avec la même adresse e-mail existe déjà.",
    "EMAIL_NOT_EMPTY": "L'adresse e-mail ne doit pas être vide.",
    "EMAIL_INVALID": "Veuillez saisir une adresse e-mail valide.",
    "EMAIL_ALREADY_EXISTS": "Un compte existe déjà avec l'adresse e-mail fournie.",
    "PASSWORD_REQUIRED": "Le mot de passe est requis.",
    "CONFIRM_PASSWORD_REQUIRED": "La confirmation du mot de passe est requise.",
    "CONFIRM_PASSWORD_MUST_BE_STRING": "La confirmation du mot de passe doit être un texte valide.",
    "PHONE_NUMBER_REQUIRED": "Le numéro de téléphone est requis.",
    "PHONE_NUMBER_MUST_BE_STRING": "Le numéro de téléphone doit être un texte valide.",
    "PHONE_NUMBER_INVALID": "Le numéro de téléphone doit comporter au moins 10 chiffres.",
    "PHONE_NUMBER_INVALID_LENGTH": "Le numéro de téléphone ne doit pas comporter plus de 10 chiffres.",
    "PROFILE_IMAGE_MISSING": "Veuillez télécharger une image de profil.",
    "USER_DISABLE": "L'utilisateur a réussi la désactivation.",
    "USER_NOT_DISABLE": "Échec de la désactivation de l'utilisateur.",

    "IMAGE_UPLOAD": "Image téléchargée avec succès.",
    "IMAGE_NOT_UPLOAD": "Erreur lors du téléchargement de l'image. Veuillez réessayer plus tard.",
    "IMAGE_FOUND": "Image trouvée.",
    "IMAGE_NOT_FOUND": "Image introuvable.",
    "IMAGE_UPDATED": "Image mise à jour avec succès.",
    "IMAGE_NOT_UPDATED": "Erreur lors de la mise à jour de l'image. Veuillez réessayer plus tard.",
    "IMAGE_ALLOWED": "Seules les images JPEG, JPG et PNG sont autorisées",
    "PAYMENT_INTENT_CREATED": "Intention de paiement créée avec succès.",
    "PAYMENT_INTENT_NOT_CREATED": "Échec de la création de l'intention de paiement. Veuillez réessayer.",
    "AMOUNT_REQUIRED": "Veuillez fournir le montant du paiement.",
    "CURRENCY_REQUIRED": "Veuillez spécifier la devise du paiement.",
    "CURRENCY_MUST_BE_STRING": "La devise doit être une chaîne valide.",
    "PAYMENT_CREATED": "Paiement initié avec succès en utilisant la méthode PayPal",
    "PAYMENT_EXECUTE": "Paiement exécuté avec succès en utilisant la méthode PayPal",
    "PAYMENT_NOT_EXECUTE": "Le paiement via PayPal a échoué. Veuillez réessayer ou utiliser une autre méthode. Contactez le support si nécessaire.",
    "GPAY_PAYMENT_CREATED": "Paiement initié avec succès avec G-Pay.",
    "GPAY_PAYMENT_NOT_CREATED": "L'initiation du paiement avec G-Pay a échoué. Veuillez réessayer ou contacter le support.",
    "PAYMENT_HISTORY_FOUND": "Historique des paiements de l'utilisateur récupéré avec succès.",
    "PAYMENT_HISTORY_NOT_FOUND": "Aucun historique de paiement trouvé pour l'utilisateur.",
    
    "ADMIN_PERMISSION": "Cette ressource est accessible uniquement aux utilisateurs administrateurs.",

    "PLAN_CREATED": "Plan créé avec succès.",
    "PLAN_NOT_CREATED": "Échec de la création du plan.",
    "PLAN_UPDATED": "Plan mis à jour avec succès.",
    "PLAN_NOT_UPDATED": "Échec de la mise à jour du plan.",
    "PLAN_DELETED": "Plan supprimé avec succès.",
    "PLAN_NOT_DELETED": "Échec de la suppression du plan.",
    "PLAN_DISABLE": "Plan désactivé avec succès.",
    "PLAN_NOT_DISABLE": "Échec de la désactivation du plan.",
    "PLAN_FOUND": "Plan trouvé avec succès.",
    "PLAN_NOT_FOUND": "Plan introuvable.",
    "PLAN_FEATURE_CREATED": "Fonctionnalité du plan créée avec succès.",
    "PLAN_FEATURE_NOT_CREATED": "Échec de la création de la fonctionnalité du plan.",
    "PLAN_FEATURE_UPDATED": "Fonctionnalité du plan mise à jour avec succès.",
    "PLAN_FEATURE_NOT_UPDATED": "Échec de la mise à jour de la fonctionnalité du plan.",
    "PLAN_FEATURE_DELETED": "Fonctionnalité du plan supprimée avec succès.",
    "PLAN_FEATURE_NOT_DELETED": "Échec de la suppression de la fonctionnalité du plan.",
    "PLAN_FEATURE_DISABLE": "Fonctionnalité du plan désactivée avec succès.",
    "PLAN_FEATURE_NOT_DISABLE": "Échec de la désactivation de la fonctionnalité du plan.",
    "PLAN_FEATURE_FOUND": "Fonctionnalité du plan trouvée avec succès.",
    "PLAN_FEATURE_NOT_FOUND": "Fonctionnalité du plan introuvable.",
    "PLAN_AMOUNT_REQUIRED": "Le montant est requis pour créer un plan.",
    "PLAN_CURRENCY_REQUIRED": "La devise est requise pour créer un plan.",
    "PLAN_NAME_REQUIRED": "Le nom du plan est requis pour créer un plan.",
    "PLAN_TYPE_REQUIRED": "Le type de plan est requis pour créer un plan.",
    "PLAN_LIMIT_REQUIRED": "La limite du plan est requise pour créer un plan.",
    "PLAN_FEATURE_NAME_REQUIRED":
    "Le nom de la fonctionnalité du plan est requis pour créer une fonctionnalité de plan.",

    "ORDER_NOT_FOUND": "Désolé, nous n'avons pas pu trouver cette commande. Veuillez vérifier les détails et réessayer.",
    "EMAIL_NOT_SENT": "Email de la facture non envoyé. Vérifiez votre adresse email dans les paramètres ou contactez le support.",
    "STRIPE_PAYMENT_CREATED": "Paiement traité via Stripe. Merci ! Des questions ? N'hésitez pas à nous contacter à tout moment.",
    "STRIPE_PAYMENT_NOT_CREATED": "Paiement Stripe non réussi. Vérifiez les détails ou contactez-nous pour des alternatives.",
    "PAYMENT_FOUND": "Informations de paiement récupérées avec succès.",
    "PAYMENT_NOT_FOUND": "Aucun enregistrement de paiement trouvé pour la requête spécifiée.",
    "ORDER_FOUND_SUCCESS": "Commande trouvée avec succès. Voici les détails que vous avez demandés.",
    "PERMISSION_ADD_SUCCESS": "Permission ajoutée avec succès.",
    "PERMISSION_ADD_ERROR": "Une erreur s'est produite lors de l'ajout de la permission. Veuillez réessayer.",
    "PERMISSION_UPDATE_SUCCESS": "Permission mise à jour avec succès.",
    "PERMISSION_UPDATE_ERROR": "Échec de la mise à jour de la permission. Veuillez vérifier vos entrées et réessayer.",
    "PERMISSION_DELETE_SUCCESS": "Permission supprimée avec succès.",
    "PERMISSION_DELETE_ERROR": "Échec de la suppression de la permission. Veuillez vous assurer que la permission existe et réessayer.",
    "PERMISSION_FOUND_SUCCESS": "Permission trouvée avec succès.",
    "PERMISSION_FOUND_ERROR": "Permission introuvable. Veuillez vérifier les détails de la permission et réessayer.",

    "FREE_PLAN_PURCHASE": "Acheter avec succès un forfait gratuit.",
    "FREE_PLAN_NOT_PURCHASE": "Forfait gratuit sans achat. Veuillez réessayer.",

    "PERMISSION_NAME_REQUIRED": "Nom permission requis.",
    "PERMISSION_ALREADY_EXISTS":"Une permission portant le même nom existe déjà."

}