{

    "INTERNAL_SERVER_ERROR_MESSAGE" : "¡Error Interno del Servidor!",
    "NOT_FOUND_MESSAGE" : "¡Recurso no encontrado!",
    "AUTHORIZATION_ERROR_MESSAGE" : "Usuario no autorizada!",
    "PERMISSION_AUTHORIZATION_ERROR": "No tienes los permisos necesarios para acceder a este recurso.",

    "LOGIN_SUCCESSFUL": "Has iniciado sesión exitosamente.",
    "LOGIN_FAILED": "Inicio de sesión fallido. Por favor verifica tu correo electrónico y contraseña.",
    "LOGOUT_SUCCESSFUL": "Has cerrado sesión exitosamente.",
    "LOGOUT_FAILED": "Error al cerrar sesión. Por favor inténtalo nuevamente más tarde.",
    "USER_NOT_FOUND": "Usuario no encontrado. Por favor regístrate para continuar.",
    "LOGIN_UN_SUCCESSFUL_WITHOUT_PASSWORD": "Por favor establece una contraseña antes de iniciar sesión.",
    "INVALID_EMAIL": "Dirección de correo electrónico no válida. Por favor ingresa un correo válido.",
    "INVALID_PASSWORD": "Contraseña no válida. Las contraseñas deben tener al menos 6 caracteres de longitud.",
    "URL_CORRECT": "El enlace para restablecer tu contraseña es válido.",
    "URL_EXPIRED": "El enlace para restablecer tu contraseña ha expirado. Por favor solicita un nuevo enlace.",
    "LINK_INCORRECT": "El enlace para restablecer tu contraseña es incorrecto. Por favor asegúrate de copiarlo correctamente.",
    "INVITE_URL_CORRECT": "El enlace para configurar tu contraseña es válido.",
    "INVITE_URL_EXPIRED": "Tu código de invitación ha expirado. Por favor solicita uno nuevo.",
    "INVITE_LINK_INCORRECT": "El código de invitación es incorrecto. Por favor asegúrate de copiarlo correctamente.",
    "EMAIL_SENT": "Por favor revisa tu bandeja de entrada de correo electrónico para el enlace para cambiar tu contraseña.",
    "PASSWORD_RESET_SUCCESSFULLY": "Tu contraseña ha sido restablecida exitosamente.",
    "PASSWORD_RESET_UN_SUCCESSFULLY": "No se pudo restablecer tu contraseña. Por favor inténtalo nuevamente más tarde.",
    "CURRENT_PASSWORD_INVALID": "La contraseña actual que ingresaste no es válida.",
    "INITIAL_PASSWORD_SETUP_SUCCESS": "Configuración de contraseña exitosa. Ahora puedes iniciar sesión.",
    "INITIAL_PASSWORD_SETUP_ERROR": "Configuración de contraseña fallida. Por favor inténtalo nuevamente.",
    "PASSWORD_CHANGE_SUCCESSFULLY": "Contraseña cambiada exitosamente.",
    "PASSWORD_CHANGE_UN_SUCCESSFULLY": "No se pudo actualizar tu contraseña. Por favor inténtalo nuevamente.",
    "PASSWORD_MISMATCH": "La nueva contraseña y la confirmación de contraseña no coinciden.",
    "EMAIL_ERROR_MISSING": "Falta la dirección de correo electrónico. Por favor ingresa tu correo electrónico.",
    "EMAIL_ERROR_EMPTY": "La dirección de correo electrónico está vacía. Por favor ingresa tu correo electrónico.",
    "EMAIL_ERROR_INVALID": "Dirección de correo electrónico no válida. Por favor ingresa un correo válido.",
    "EMAIL_UNIQUE": "La dirección de correo electrónico debe ser única. Por favor utiliza una dirección de correo diferente.",
    "EMAIL_REQUIRED": "La dirección de correo electrónico es requerida. Por favor ingresa tu correo electrónico.",
    "NAME_MISSING": "Falta el nombre. Por favor ingresa tu nombre.",
    "NAME_EMPTY": "El nombre está vacío. Por favor ingresa tu nombre.",
    "PASSWORD_ERROR_MISSING": "Falta la contraseña. Por favor ingresa tu contraseña.",
    "PASSWORD_ERROR_EMPTY": "La contraseña está vacía. Por favor ingresa tu contraseña.",
    "PASSWORD_MUST_BE_STRING": "La contraseña debe ser un texto válido. Por favor ingresa una contraseña válida.",
    "PASSWORD_LENGTH": "La contraseña debe tener al menos 6 caracteres.",
    "IN_VALID_PASSWORD_TYPE": "La contraseña debe contener al menos 1 dígito, 1 letra en mayúscula, 1 carácter especial, y tener entre 6 y 15 caracteres de longitud.",
    "OLD_PASSWORD_REQUIRED": "Por favor ingresa tu contraseña actual.",
    "NEW_PASSWORD_REQUIRED": "Por favor ingresa tu nueva contraseña.",
    "CONFIRM_PASSWORD": "El campo de confirmación de contraseña es requerido. Por favor confirma tu contraseña.",
    "IN_VALID_CONFIRM_PASSWORD": "La contraseña de confirmación no coincide con la contraseña. Por favor asegúrate de que sean iguales.",
    "TOKEN_INVALID": "Tu token para restablecer la contraseña no es válido. Por favor ingresa un token válido.",
    "TOKEN_REQUIRED": "Se requiere un token para restablecer la contraseña. Por favor ingresa un token válido.",
    "MISSING_ACCESS_TOKEN": "Se requiere un token de acceso. Por favor proporciona un token válido.",
    "INVALID_CREDENTIAL": "Credenciales inválidas. Por favor, verifica tu correo electrónico y contraseña.",

    "USER_ALREADY_EXISTS":
    "¡Ups! Parece que ya hay un usuario registrado con este correo electrónico o número de teléfono. Por favor, utiliza un correo electrónico o número de teléfono diferente para crear una nueva cuenta.",
    "USERS_FOUND": "Usuarios encontrados.",
    "USERS_NOT_FOUND": "No se encontraron usuarios.",
    "USERS_ADDED": "Usuarios guardados exitosamente.",
    "USERS_NOT_ADDED": "No se pudieron guardar los usuarios.",
    "USERS_ADD_REJECTED": "El correo electrónico de los usuarios debe ser único.",
    "USER_UPDATED": "Usuario actualizado exitosamente.",
    "USER_NOT_UPDATE": "No se pudo actualizar el usuario.",
    "USER_DELETED": "Usuario eliminado exitosamente.",
    "USER_NOT_DELETE": "No se pudo eliminar el usuario.",
    "FIRST_NAME_REQUIRED": "Se requiere el nombre.",
    "FIRST_NAME_MUST_BE_STRING": "El nombre debe ser un texto válido.",
    "LAST_NAME_REQUIRED": "Se requiere el apellido.",
    "LAST_NAME_MUST_BE_STRING": "El apellido debe ser un texto válido.",
    "EMAIL_EXISTS": "Ya existe un usuario con el mismo correo electrónico.",
    "EMAIL_NOT_EMPTY": "El correo electrónico no debe estar vacío.",
    "EMAIL_INVALID": "Por favor ingresa un correo electrónico válido.",
    "EMAIL_ALREADY_EXISTS": "Ya existe una cuenta con el correo electrónico proporcionado.",
    "PASSWORD_REQUIRED": "Se requiere una contraseña.",
    "CONFIRM_PASSWORD_REQUIRED": "Se requiere la confirmación de contraseña.",
    "CONFIRM_PASSWORD_MUST_BE_STRING": "La confirmación de contraseña debe ser un texto válido.",
    "PHONE_NUMBER_REQUIRED": "Se requiere el número de teléfono.",
    "PHONE_NUMBER_MUST_BE_STRING": "El número de teléfono debe ser un texto válido.",
    "PHONE_NUMBER_INVALID": "El número de teléfono debe tener al menos 10 dígitos.",
    "PHONE_NUMBER_INVALID_LENGTH": "El número de teléfono debe tener como máximo 10 dígitos.",
    "PROFILE_IMAGE_MISSING": "Por favor, sube una imagen de perfil.",
    "USER_DISABLE": "Usuario deshabilitado con éxito",
    "USER_NOT_DISABLE": "No se pudo desactivar la usuaria.",

    "IMAGE_UPLOAD": "Imagen cargada exitosamente.",
    "IMAGE_NOT_UPLOAD": "Error al cargar la imagen. Por favor, inténtalo de nuevo más tarde.",
    "IMAGE_FOUND": "Imagen encontrada.",
    "IMAGE_NOT_FOUND": "Imagen no encontrada.",
    "IMAGE_UPDATED": "Imagen actualizada exitosamente.",
    "IMAGE_NOT_UPDATED": "Error al actualizar la imagen. Por favor, inténtalo de nuevo más tarde.",
    "IMAGE_ALLOWED": "Solo se permiten imágenes JPEG, JPG y PNG",
    "PAYMENT_INTENT_CREATED": "Pago registrado exitosamente.",
    "PAYMENT_INTENT_NOT_CREATED": "Error al crear el intento de pago. Por favor, inténtelo nuevamente.",
    "AMOUNT_REQUIRED": "Por favor, indique el monto del pago.",
    "CURRENCY_REQUIRED": "Por favor, especifique la moneda para el pago.",
    "CURRENCY_MUST_BE_STRING": "La moneda debe ser una cadena válida.",
    "PAYMENT_CREATED": "Pago iniciado con éxito utilizando el método de PayPal",
    "PAYMENT_EXECUTE": "Pago ejecutado exitosamente utilizando el método de PayPal",
    "PAYMENT_NOT_EXECUTE": "El pago a través de PayPal falló. Por favor, inténtalo de nuevo o utiliza otro método. Contacta al soporte si es necesario.",
    "GPAY_PAYMENT_CREATED": "Pago iniciado exitosamente con G-Pay.",
    "GPAY_PAYMENT_NOT_CREATED": "La iniciación del pago con G-Pay falló. Por favor, inténtalo nuevamente o contacta al soporte.",
    "PAYMENT_HISTORY_FOUND": "Historial de pagos del usuario obtenido exitosamente.",
    "PAYMENT_HISTORY_NOT_FOUND": "No se encontró historial de pagos para el usuario.",

    "ADMIN_PERMISSION": "Solo los usuarios administradores pueden acceder a este recurso",

    "PLAN_CREATED": "Plan creado exitosamente.",
    "PLAN_NOT_CREATED": "No se pudo crear el plan.",
    "PLAN_UPDATED": "Plan actualizado exitosamente.",
    "PLAN_NOT_UPDATED": "No se pudo actualizar el plan.",
    "PLAN_DELETED": "Plan eliminado exitosamente.",
    "PLAN_NOT_DELETED": "No se pudo eliminar el plan.",
    "PLAN_DISABLE": "Plan desactivado exitosamente.",
    "PLAN_NOT_DISABLE": "No se pudo desactivar el plan.",
    "PLAN_FOUND": "Plan encontrado exitosamente.",
    "PLAN_NOT_FOUND": "Plan no encontrado.",
    "PLAN_FEATURE_CREATED": "Característica del plan creada exitosamente.",
    "PLAN_FEATURE_NOT_CREATED": "No se pudo crear la característica del plan.",
    "PLAN_FEATURE_UPDATED": "Característica del plan actualizada exitosamente.",
    "PLAN_FEATURE_NOT_UPDATED": "No se pudo actualizar la característica del plan.",
    "PLAN_FEATURE_DELETED": "Característica del plan eliminada exitosamente.",
    "PLAN_FEATURE_NOT_DELETED": "No se pudo eliminar la característica del plan.",
    "PLAN_FEATURE_DISABLE": "Característica del plan desactivada exitosamente.",
    "PLAN_FEATURE_NOT_DISABLE": "No se pudo desactivar la característica del plan.",
    "PLAN_FEATURE_FOUND": "Característica del plan encontrada exitosamente.",
    "PLAN_FEATURE_NOT_FOUND": "Característica del plan no encontrada.",
    "PLAN_AMOUNT_REQUIRED": "Se requiere el monto para crear un plan.",
    "PLAN_CURRENCY_REQUIRED": "Se requiere la moneda para crear un plan.",
    "PLAN_NAME_REQUIRED": "Se requiere el nombre del plan para crear un plan.",
    "PLAN_TYPE_REQUIRED": "Se requiere el tipo de plan para crear un plan.",
    "PLAN_LIMIT_REQUIRED": "Se requiere el límite del plan para crear un plan.",
    "PLAN_FEATURE_NAME_REQUIRED":
    "Se requiere el nombre de la característica del plan para crear una característica de plan.",

    "ORDER_NOT_FOUND": "Lo sentimos, no pudimos encontrar ese pedido. Por favor, verifica los detalles e intenta nuevamente.",
    "EMAIL_NOT_SENT": "Correo de la factura no enviado. Verifica tu correo electrónico en la configuración o contacta al soporte.",
    "STRIPE_PAYMENT_CREATED": "Pago procesado a través de Stripe. ¡Gracias! ¿Tienes alguna pregunta? Contáctanos en cualquier momento.",
    "STRIPE_PAYMENT_NOT_CREATED": "Pago Stripe no exitoso. Verifica los detalles o contáctanos para conocer alternativas.",
    "PAYMENT_FOUND": "Información de pago obtenida correctamente.",
    "PAYMENT_NOT_FOUND": "No se encontraron registros de pago para la consulta especificada.",
    "ORDER_FOUND_SUCCESS": "Pedido encontrado con éxito. Aquí están los detalles que solicitaste.",
    "PERMISSION_ADD_SUCCESS": "Permiso agregado exitosamente.",
    "PERMISSION_ADD_ERROR": "Ocurrió un error al agregar el permiso. Por favor, intenta nuevamente.",
    "PERMISSION_UPDATE_SUCCESS": "Permiso actualizado exitosamente.",
    "PERMISSION_UPDATE_ERROR": "No se pudo actualizar el permiso. Por favor, verifica tus entradas e intenta nuevamente.",
    "PERMISSION_DELETE_SUCCESS": "Permiso eliminado exitosamente.",
    "PERMISSION_DELETE_ERROR": "Error al eliminar el permiso. Por favor, asegúrate de que el permiso exista e intenta nuevamente.",
    "PERMISSION_FOUND_SUCCESS": "Permiso encontrado exitosamente.",
    "PERMISSION_FOUND_ERROR": "Permiso no encontrado. Por favor, verifica los detalles del permiso e intenta nuevamente.",

            
    "FREE_PLAN_PURCHASE": "Compra exitosa del plan gratuito.",
    "FREE_PLAN_NOT_PURCHASE": "Plan gratuito sin compra. Inténtalo de nuevo.",

    "PERMISSION_NAME_REQUIRED": "Nombre de permiso requerido.",
    "PERMISSION_ALREADY_EXISTS":"El permiso con el mismo nombre ya existe"
}